a76664289/KlipperScreen-esp/src/ports/esp32/sdkconfig.defaults.JC4827W543C
# ===== 目标芯片 =====
CONFIG_IDF_TARGET="esp32s3"
# 板型：JC4827W543C（ESP32-S3，4.3" 480x272 QSPI NV3041A + GT911 电容触摸）
CONFIG_BOARD_JC4827W543C=y

# ESP32-S3：Flash 4MB 80MHz QIO，Octal PSRAM 80MHz
# QSPI 屏全帧缓冲（480x272x2B = 261KB）必须放 PSRAM
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# 不开 XIP：让代码取指走 Flash，避免与 PSRAM 里的 framebuffer 争抢 MSPI
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set

# 4MB flash 专用分区表（factory 3MB，storage 960KB）
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_JC4827W543C.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_JC4827W543C.csv"

# LVGL 渲染周期 15ms
CONFIG_LV_DEF_REFR_PERIOD=15

# -O2：和 jc8048w550 一致，避免 -Og 下滑动整页渲染超帧预算
# 4MB flash 下体积压力大，如果 app 溢出可改回 CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 关闭旋转编码器
# CONFIG_INPUT_ROTARY_ENCODER is not set

# ===== 字库裁剪（4MB flash 必须精简）=====
# 只保留常用字号，去掉不必要的大字号
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
# CONFIG_LV_FONT_MONTSERRAT_18 is not set
# CONFIG_LV_FONT_MONTSERRAT_20 is not set
# CONFIG_LV_FONT_MONTSERRAT_22 is not set
CONFIG_LV_FONT_MONTSERRAT_24=y
# CONFIG_LV_FONT_MONTSERRAT_26 is not set
CONFIG_LV_FONT_MONTSERRAT_28=y
# CONFIG_LV_FONT_MONTSERRAT_30 is not set
CONFIG_LV_FONT_MONTSERRAT_32=y
# CONFIG_LV_FONT_MONTSERRAT_34 is not set
# CONFIG_LV_FONT_MONTSERRAT_36 is not set
# CONFIG_LV_FONT_MONTSERRAT_38 is not set
# CONFIG_LV_FONT_MONTSERRAT_40 is not set
# CONFIG_LV_FONT_MONTSERRAT_42 is not set
# CONFIG_LV_FONT_MONTSERRAT_44 is not set
# CONFIG_LV_FONT_MONTSERRAT_46 is not set
# CONFIG_LV_FONT_MONTSERRAT_48 is not set
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# 中文字库：用压缩（LV_FONT_FMT_TXT_LARGE 打开），4MB 下必须这样做
# 如果掉帧严重，考虑把字库放 littlefs 并 mmap 加载
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y